# CircularDependencyResolved Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RegenFailures..::..CircularDependencyResolved Property
BuiltInFailures..::..RegenFailures Class See Also
---
There was a circular chain of references among the highlighted elements that was attempted to resolve. User-visible text will depend on original error returned by offending element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircularDependencyResolved { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircularDependencyResolved As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircularDependencyResolved {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RegenFailures Class
Autodesk.Revit.DB Namespace